# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'httpie'

brew 'ffmpeg'
brew 'youtube-dl'

# Development
brew 'php71'
brew 'php71-intl'
brew 'mariadb'

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'gpgtools'
cask 'iterm2'
cask 'mysqlworkbench'
cask 'phpstorm'
cask 'quip'
cask 'sequel-pro'
cask 'shuttle'
cask 'slack'
cask 'sublime-text'
cask 'tower'
cask 'cyberduck'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'etcher'
# cask 'telegram-desktop'
cask 'telegram'
cask 'textmate'
cask 'sourcetree'
cask 'macdown'
cask 'teamviewer'
cask 'tunnelblick'
cask 'openoffice'
cask 'skype'
cask 'colloquy'
cask 'docker'
cask 'docker-toolbox'
cask 'tigervnc-viewer'


# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
# cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Sip', id: 507257563
mas 'TweetDeck', id:485812721
mas 'MemoryClean', id:451444120
